In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
dataset = pd.read_excel (r"C:\Users\Admin\Machine Learning\home.xlsx")
dataset.head(10)

   area  bedrooms    price  livingroms placename
0  1056        2.0   39.07         1.0     Dhaka
1  2600        4.0  120.00         2.0       NaN
2  1440        3.0   62.00         NaN     Dhaka
3  1521        3.0   75.00         3.0      Khul
4  1200        2.0     NaN         NaN       Raj
5  1170        NaN   38.00         NaN       NaN
6  2732        4.0  135.00         4.0      Bari
7  3300        4.0     NaN         NaN   Gulshan
8  1310        NaN   50.00         5.0       NaN
9  3700        5.0  167.00         4.0    Khulna

In [3]:
dataset.isnull().sum()

area          0
bedrooms      4
price         4
livingroms    7
placename     6
dtype: int64

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   area        19 non-null     int64
 1   bedrooms    15 non-null     float64
 2   price       15 non-null     float64
 3   livingroms  12 non-null     float64
 4   placename   13 non-null     object
dtypes: float64(3), int64(1), object(1)
memory usage: 892.0+ bytes

In [7]:
#How to fill Missing value
dataset.select_dtypes(include="float64").columns

Index(['bedrooms ', 'price', 'livingroms'], dtype='object')

In [9]:
from sklearn.impute import SimpleImputer

In [12]:
si= SimpleImputer(strategy="mean")
ar=si.fit_transform(dataset[['bedrooms ', 'price', 'livingroms']])

In [13]:
#how to convert array data to dataframe
new_dataset=pd.DataFrame(ar, columns=dataset.select_dtypes(include="float64").columns)

In [14]:
new_dataset.isnull().sum()

bedrooms      0
price         0
livingroms    0
dtype: int64

In [15]:
new_dataset

    bedrooms     price  livingroms
0    2.000000   39.070    1.000000
1    4.000000  120.000    2.000000
2    3.000000   62.000    3.333333
3    3.000000   75.000    3.000000
4    2.000000   72.138    3.333333
5    3.133333   38.000    3.333333
6    4.000000  135.000    4.000000
7    4.000000   72.138    3.333333
8    3.133333   50.000    5.000000
9    5.000000  167.000    4.000000
10   3.000000   82.000    2.000000
11   4.000000   72.138    3.333333
12   3.133333   38.000    4.000000
13   2.000000   40.000    4.000000
14   3.000000   72.138    3.333333
15   2.000000   42.000    2.000000
16   3.133333   60.000    3.333333
17   3.000000  102.000    4.000000
18   3.000000   32.000    5.000000

In [16]:
dataset["price"].mean()

72.13799999999999